src/main/java/ru/vk/itmo/test/tveritinalexandr/reports/step_2/wrk2/get_wrk2_output
tveritinaleksandr@Tveritins-MacBook-Pro wrk2-arm % ./wrk -d 25 -t 1 -c 32 -R 40000 -L -s /Users/tveritinaleksandr/IdeaProjects/2024-highload-dht/src/main/java/ru/vk/itmo/test/tveritinalexandr/lua/get_request.lua http://localhost:8080

Running 25s test @ http://localhost:8080
  1 threads and 32 connections
  Thread calibration: mean lat.: 39.688ms, rate sampling interval: 195ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   192.16ms  175.49ms 788.48ms   73.07%
    Req/Sec    39.05k     2.52k   41.02k    89.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  143.74ms
 75.000%  283.65ms
 90.000%  451.84ms
 99.000%  716.80ms
 99.900%  778.75ms
 99.990%  786.94ms
 99.999%  788.48ms
100.000%  788.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.245     0.000000            1         1.00
      14.471     0.100000        57797         1.11
      34.271     0.200000       115568         1.25
      58.047     0.300000       173348         1.43
     106.175     0.400000       231167         1.67
     143.743     0.500000       289023         2.00
     161.023     0.550000       317839         2.22
     189.311     0.600000       346731         2.50
     227.327     0.650000       375613         2.86
     254.079     0.700000       404520         3.33
     283.647     0.750000       433343         4.00
     312.575     0.775000       448036         4.44
     329.215     0.800000       462478         5.00
     347.903     0.825000       476674         5.71
     380.159     0.850000       491155         6.67
     414.207     0.875000       505569         8.00
     432.639     0.887500       512837         8.89
     451.839     0.900000       520035        10.00
     470.527     0.912500       527290        11.43
     493.567     0.925000       534542        13.33
     516.863     0.937500       541670        16.00
     540.671     0.943750       545379        17.78
     575.999     0.950000       549046        20.00
     598.527     0.956250       552596        22.86
     610.815     0.962500       556230        26.67
     624.127     0.968750       559742        32.00
     635.391     0.971875       561610        35.56
     642.047     0.975000       563529        40.00
     648.703     0.978125       565160        45.71
     666.111     0.981250       566968        53.33
     679.423     0.984375       568783        64.00
     685.567     0.985938       569676        71.11
     701.439     0.987500       570598        80.00
     709.119     0.989062       571489        91.43
     721.919     0.990625       572418       106.67
     730.111     0.992188       573275       128.00
     734.719     0.992969       573814       142.22
     736.767     0.993750       574175       160.00
     743.935     0.994531       574647       182.86
     751.615     0.995313       575173       213.33
     754.687     0.996094       575529       256.00
     756.223     0.996484       575750       284.44
     766.463     0.996875       575982       320.00
     772.607     0.997266       576205       365.71
     775.679     0.997656       576436       426.67
     776.703     0.998047       576671       512.00
     777.215     0.998242       576806       568.89
     777.727     0.998437       576949       640.00
     778.239     0.998633       577121       731.43
     778.239     0.998828       577121       853.33
     778.751     0.999023       577261      1024.00
     779.263     0.999121       577326      1137.78
     779.775     0.999219       577364      1280.00
     780.287     0.999316       577425      1462.86
     780.799     0.999414       577465      1706.67
     781.823     0.999512       577535      2048.00
     781.823     0.999561       577535      2275.56
     782.335     0.999609       577565      2560.00
     782.847     0.999658       577605      2925.71
     783.359     0.999707       577637      3413.33
     783.871     0.999756       577646      4096.00
     784.383     0.999780       577665      4551.11
     784.895     0.999805       577684      5120.00
     784.895     0.999829       577684      5851.43
     785.919     0.999854       577702      6826.67
     786.431     0.999878       577718      8192.00
     786.431     0.999890       577718      9102.22
     786.943     0.999902       577732     10240.00
     786.943     0.999915       577732     11702.86
     787.455     0.999927       577767     13653.33
     787.455     0.999939       577767     16384.00
     787.455     0.999945       577767     18204.44
     787.455     0.999951       577767     20480.00
     787.455     0.999957       577767     23405.71
     787.455     0.999963       577767     27306.67
     787.455     0.999969       577767     32768.00
     787.455     0.999973       577767     36408.89
     787.455     0.999976       577767     40960.00
     787.967     0.999979       577773     46811.43
     787.967     0.999982       577773     54613.33
     787.967     0.999985       577773     65536.00
     788.479     0.999986       577776     72817.78
     788.479     0.999988       577776     81920.00
     788.479     0.999989       577776     93622.86
     788.479     0.999991       577776    109226.67
     788.991     0.999992       577781    131072.00
     788.991     1.000000       577781          inf
#[Mean    =      192.158, StdDeviation   =      175.494]
#[Max     =      788.480, Total count    =       577781]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  978065 requests in 25.00s, 87.70MB read
  Non-2xx or 3xx responses: 524711
Requests/sec:  39122.85
Transfer/sec:      3.51MB